"use client";

import { useState } from "react";
import ServicesList from "./ServicesList"; // Ներմուծում ենք քարտերի կոմպոնենտը

export default function Carayutyunbajin() {
    // 0-ն ապահովում է, որ էջը բացվելիս «Սպասարկում» բաժինը միանգամից ակտիվ լինի
    const [active, setActive] = useState(0);

    const bajinner = [
        {
            title: "Սպասարկում",
            image: "https://api.amaranoc.am/service.svg",
            services: [
                {
                    name: "Մատուցող",
                    description: "Յուրաքանյչուր մատուցող կարող է սպասարկել 15-20 անձի։Ծառայության արժեքը կախված է միջոցառման անցկացման վայրից։Ձեր միջոցառման կազմակերպման գործում Ձեզ կօգնեն մեր փորձառու մատուցողները: Հաղորդակցման գերազանց հմտություններով և մանրուքների հանդեպ ուշադրությամբ, նրանք կապահովեն հյուրընկալ մթնոլորտ և բարձրակարգ սպասարկում։ Մեր հանգստյան գոտիներում անցկացրած միջոցառումները կթողնեն անմոռանալի հիշողություններ ի շնորհիվ մեր տարիների փորձի։",
                    price: 25000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1724331775249--0.16594454212797016image.webp&w=1920&q=75"
                },
                {
                    name: "Բարմեն",
                    description: "Մեր պրոֆեսիոնալ բարմենները տիրապետում են տարբեր տեսակի խմիչքների պատրաստման հմտություններին։ Մեր բարմենները պատասխանատու են բարում նստած հաճախորդներին բարձրակարգ սպասարկում մատուցելու համար, ինչպես նաև հյուրերին խմիչքների ընտրության հարցում խորհրդատվություն տրամադրելու, հաճախորդների պահանջներին արձագանքելու համար։",
                    price: 25000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1724330468263--0.5829426973721912image.webp&w=1920&q=75"
                },
                {
                    name: "Խոհարար",
                    description: "Արժեքը կախված է միջոցառման անձանց քանակից և ուտեստների մենյուից։Ունենալով հարուստ փորձ և տաղանդ, Մեր խոհարարները ստեղծում են համերի և նրբաճաշակության զարմանալի համադրություններ: Մեր խոհարարները ընտրում են միայն ամենաթարմ և ամենաբարձր որակի բաղադրիչները, որպեսզի Ձեզ մատուցեն յուրահատուկ խոհարարական փորձ: Մեր խոհարարները պատասխանատու են սննդի պատրաստման և պատրաստման տեխնիկայ։համար: Նրանք ապահովում են ցանկացած տեսակի սննդի պատրաստումը՝ նախնական համաձայնության գալով միջոցառման կազմակերպչի հետ։",
                    price: 35000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1724331582281--0.8016246618454268image.webp&w=1920&q=75"
                },
                {
                    name: "Հանդիսավար",
                    description: "Այս բաժնում մենք կփորձենք օգնել Ձեզ հանդիսավարի (թամադայի), ընտրության հարցում, քանի որ միայն իսկական հանդիսավարը կարող է իր վարպետությամբ ստեղծել հիասքանչ և տոնական մթնոլորտ։ ",
                    price: 60000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1724346434036--0.5362400594372552image.webp&w=1920&q=75"
                },
                {
                    name: "Փրփուր Փարթի",
                    description: "Նյութերը սերտիֆիկացված են, աչքերը չեն մռմռացնում, ալերգիա չեն առաջացնում, անվնաս են նաև բույսերի և լողավազանի համար:",
                    price: 26900,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1725721755318--0.3513684578103693image.webp&w=1920&q=75"
                }
            ]
        },
        {
            title: "Շոու",
            image: "https://api.amaranoc.am/services1.svg",
            services: [
                {
                    name: "Դի-Ջեյ",
                    description: "Դիջեյներն Մեր կազմակերպած միջոցառումների աստղերն են՝ ովքեր ստեղծում են յուրահատուկ մթնոլորտ և զվարճանք: Amaranoc.am-ի դիջեյները վարպետորեն տիրապետում են երաժշտական ​​ռեպերտուարին, որը կարող է գոհացնել յուրաքանչյուր ճաշակ և բարձրացնել  տրամադրություն: Իրենց երաժշտական ​​միքսերով նրանք երեկոն վերածում են իրական խնջույքի,որը դեռ երկար կմնա մեր հյուրերի հիշողության մեջ։",
                    price: 50000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1724333364490--0.6874775885987816image.webp&w=1920&q=75"
                },
                {
                    name: "Երգիչ",
                    description: "Amaranoc.am ի երգիչները, իրենց զարմանալի ձայնով և տաղանդով, կստեղծեն յուրահատուկ մթնոլորտ։ Ընկղմվեք հնչյունների և ռիթմերի աշխարհում՝ վայելելով երաժշտության աննկարագրելի հաճույքը։",
                    price: 150000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1724334734516--0.3032056818160267image.webp&w=1920&q=75"
                },
                {
                    name: "Կրակներով շոու",
                    description: "Կրակներով շոուն կստեղծի վառ և հիասքանչ ժամանց, որոնք կտպավորվեն մշտեպես Ձեր հիշողության մեջ։Մեր պրոֆեսիոնալ արտիստները տիրապետելով կրակի հետ խաղալու արվեստին, ստեղծում են ապշեցուցիչ գեղեցկությամբ և ադրենալինով լի ներկայացումներ: Այստեղ դուք կընկղմվեք մի աշխարհ,որտեղ դուք ամբողջովին կզգաք կրակի իրական գեղեցկությունը և ջերմությունը։",
                    price: 50000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1724336474729--0.7810543034069704image.webp&w=1920&q=75"
                },
                {
                    name: "Ջութակահար",
                    description: "Մեր տաղանդավոր երաժիշտները կստեղծեն անկրկնելի մթնոլորտ, որը կլցնի Ձեր միջոցառումը երաժշտության հրաշքներով՝ դասական հնչյուններից մինչև ժամանակակից հիթեր։ Մեղեդիների ուղեկցությամբ Դուք կտեղափոխվեք մի աշխարհ՝ լցված նրբագեղությամբ և ոգեշնչմամբ։",
                    price: 80000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1724338250161--0.20494831224542853image.webp&w=1920&q=75"
                },
                {
                    name: "Խաղավար",
                    description: "Մեր խաղավարները միշտ կգտնեն Ձեր հյուրերին ուրախացնելու և Ձեր միջոցառումը մրցույթներով զարդարելու միջոց:",
                    price: 15000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1724341573344--0.7918482283071524image.webp&w=1920&q=75"
                },
                {
                    name: "Մուլտհերոսներ",
                    description: "Մեր մուլտհերոսները կախարդական կերպարներ են, ովքեր ժպիտ ու ուրախություն կպարգևեն ոչ միայն երեխաներին, այլև մեծերին: Իրենց գունեղ անհատականություններով նրանք ձեզ կտանեն ֆանտաստիկայի և արկածների հիանալի աշխարհ՝ բարի և խիզախ սուպերհերոսներից մինչև սրամիտ և զվարճալի կենդանիներ։ Ձեր միջոցառմանը հրավիրեք Մեր սիրելի մուլտհերոսներին, և նրանք կպարգևեն Ձեր հյուրերին ուրախության և կախարդական նմոռանալի պահեր:",
                    price: 5000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1724343085065--0.7151746565655936image.webp&w=1920&q=75"
                },
                {
                    name: "Աճպարար",
                    description: "Աճպարարի յուրաքանչյուր ներկայացում՝ լինի դա խենթ շողալու մոգություն, բարդ թարմություն կամ ճկուն տեխնիկա, միշտ առանձնանում է բացառիկությամբ: Նա ստեղծում է մթնոլորտ, որտեղ իրականությունը ու երևակայությունը միաձուլվում են, իսկ հանդիսատեսը հայտնվում է մի աշխարհում, որտեղ ամեն ինչ հնարավոր է: Հրավիրելով Մեր աճպարարին Դուք հնարավորություն կունենաք ականատես լինելու  անհավատալի տեսարանների, որոնք կզարմացնեն ոչ միայն փոքրերին այլ նաև մեծերին։",
                    price: 60000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1724345942719--0.8853509893461255image.webp&w=1920&q=75"
                },
            ]
        },
        {
            title: "Միջոցառումներ",
            image: "https://api.amaranoc.am/services2.svg",
            services: [
                {
                    name: "Նշանադրության կազմակերպում",
                    description: "Նշանադրության արարողությունը առանձնահատուկ պահ է զույգի կյանքում: Մեր ընկերությունը կազմակերպում է նշանադրության արարողություն, որը ստեղծում է կախարդական պահեր սիրահարների համար: Մեր նպատակն է անմոռանալի դարձնել այդ հիասքանչ միջոցառումը։ Մենք ցուցաբերում ենք անհատական մոտեցում յուրաքանչյուր զույգին՝ օգնելով նրանց ստեղծել կատարյալ իրադարձություն։ Մեր փորձառու և ստեղծագործ թիմը կապահովի արարողության գեղեցիկ դիզայնը ,սպասարկումը, երաժշտությունը,լուսային էֆֆեկտները և բոլոր մանրուքները, ինչը կօգնի լիարժեք վայելելու Ձեր օրը։",
                    price: 500000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1724354544378--0.6598089632874184image.webp&w=1920&q=75"
                },
                {
                    name: "Ծննդյան առիթների կազմակերպում",
                    description: "«Amaranoc.am»-ը ձեր վստահելի գործընկերն է ծննդյան տոների կազմակերպման գործում: Մենք մասնագիտացած ենք ստեղծելու անմոռանալի միջոցառումներ, որոնք ընդգծում են հոբելյարի յուրահատկությունն ու անհատականությունը: Մեր կրեատիվ մասնագետների թիմը հոգ կտանի ամեն ինչի մասին՝ սկսած կոնցեպտից և դեկորից, մինչև զվարճանք և խոհարարական հյուրասիրություն: Վստահե՛ք մեզ ձեր ծննդյան օրը կազմակերպելու գործը, և այն իսկապես անմոռանալի կլինի:",
                    price: 150000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1724361248407--0.36711332876830927image.webp&w=1920&q=75"
                },
                {
                    name: "Հարսանյաց սենյակի ձևավորում",
                    description: "Հարսանյաց սենյակի ձևավորման գործում Ձեզ կօգնի Մեր դիզայներների և ոճաբանների թիմը՝ ովքեր հաշվի առնելով Ձեր նախասիրությունները և անհատականությունը, կհաղորդեն սենյակին նրբաճաշակություն, շքեղություն: Նուրբ գործվածքներից և մոմերից մինչև նրբաճաշակ ծաղիկներ և զարդեր։  ️️Վստահեք Ձեր կյանքի ամենակարևոր առիթներից մեկը Մեր թիմին, ունենալով շքեղ և չկրկնվող ձևավորումներ։",
                    price: 80000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1724359541230--0.027714150656094505image.webp&w=1920&q=75"
                },
                {
                    name: "Ֆոտոզոնաների ձևավորում",
                    description: "«Amaranoc.am» Ձեր ուղեցույցն է եզակի և հիշվող ֆոտոզոնաների ստեղծման ոլորտում: Մենք մասնագիտացած ենք լուսանկարչական գոտիների ստեղծման գործում, որոնք կատարյալ լրացում են Ձեր միջոցառման համար: Կախված Ձեր միջոցառման թեմայից, Մենք կստեղծենք լուսանկարչական գոտի, որը կարտացոլի ձեր ոճը և կտա հնարավություն ունենալու գեղեցիկ և յուրահատկուկ նկարներ: ",
                    price: 40000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1724361086474--0.7968698807367636image.webp&w=1920&q=75"
                },
                {
                    name: "Գենդեր փարթի",
                    description: "Գիտակցելով միջոցառման կարևորությունը Մեր կրեատիվ թիմը պատրաստ է ամբողջության կազմակերպելու այս գեղեցիկ օրը, դարձնելով այն անմոռանալի։ Մենք կօգնենք Ձեզ պլանավորելու, զարդարելու, խաղերի և ժամանցի հարցում, որպեսզի Ձեր միջոցառումը լինի գեղեցիկ և ուրախ իրադարձություն, որը կհիշվի ամբողջ կյանքում:",
                    price: 18000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1724362333688--0.9147879453964904image.webp&w=1920&q=75"
                }
            ]
        },
        {
            title: "Տեխնիկա",
            image: "https://api.amaranoc.am/services3.svg",
            services: [
                {
                    name: "Ծանր ծուխ",
                    description: "Լավագույն ծանր ծուխը, որը ձեր միջոցառումն կդարձնի էլ ավելի գողեցիկ և հիշարժան։ Մեր սարքավորումները կարողանում են բարձրորակ ծուխը տարածել մաքսիմալ մեծ մակերեսով և բարձր խտությամբ։ Ծուխն էկոլոգիապես մաքուր է և իր մեջ ներառում է միայն տաք ջուր։",
                    price: 30000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1725722472736--0.09950637526125772image.webp&w=1920&q=75"
                },
                {
                    name: "Հրավառության ծառայություն",
                    description: "Հրավառության ծառայությունը առաջարկում է փայլուն և անպայման հիշարժան հրավառություն՝ յուրաքանչյուր իրադարձության համար հատուկ ձևով։ Մեր թիմը կազմակերպում է բոլոր անհրաժեշտ գործընթացները՝ նախապատրաստական աշխատանքից մինչև իրականացման փուլը։ Արժեքները փոփոխվում են կախված միջոցառման ծավալից, հրավառության տեսակից և այլ հանգամանքներից։",
                    price: 30000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1725723065500--0.9235019901431423image.webp&w=1920&q=75"
                },
                {
                    name: "Սառը հրավառություն",
                    description: "Սառը հրավառության ծառայությունը առաջարկում է հիանալի, անվտանգ և արտասովոր միջոցառման լուծում՝ կրակ և ծուխ բացակայությամբ: Այս ծառայությունը օգտագործում է հատուկ պիրոտեխնիկական սարքավորումներ, որոնք ստեղծում են գեղեցիկ տեսողական էֆեկտներ՝ օգտագործելով սառը լույսեր, էֆեկտային աղմուկներ և խորը լույսեր, որոնք ի վիճակի են փոխարինել ավանդական հրավառություններին առանց կրակի վտանգի: Արժեքները փոփոխվում են կախված միջոցառման ծավալից, հրավառության տեսակից և այլ հանգամանքներից։",
                    price: 30000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1725723989251--0.9080294603522698image.webp&w=1920&q=75"
                },
                {
                    name: "Պրոյեկտոր",
                    description: "Ձեր միջոցառումները դարձնելու համար ավելի հարմարավետ ու արդյունավետ, մենք տրամադրում ենք պրոյեկտորներ տարբեր որակի և չափսերի։ Իրականացնում ենք նաև տեղադրում։ Արժեքը կախված պրոյեկտորի տեսակից կարող է փոփոխվել։",
                    price: 15000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1726041202793--0.7905783613949644image.webp&w=1920&q=75"
                },
                {
                    name: "Նվագարկիչ",
                    description: "Ձեր միջոցառման երաժշտական առավելության հասնելու համար առաջարկում ենք բարձր որակի նվագարկիչների օրավարձով վարձակալության ծառայություն: Արժեքը կարող է փոփոխվել կախված նվագարկիչների չափսերից և որակից։ ",
                    price: 10000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1726043750271--0.9652871581106086image.webp&w=1920&q=75"
                }
            ]
        },
        {
            title: "Օրավարձով գույք",
            image: "https://api.amaranoc.am/services4.svg",
            services: [
                                {
                    name: "Սպասք",
                    description: "Ձեր միջոցառումները դարձնելու համար ավելի հարմարավետ և ոճային, առաջարկում ենք օրավարձով սպասքի ծառայություններ։ Տրամադրվում է տարբեր ձևի և միանման ամաններ, գդալներ, պատառաքաղներ և այն ամենը ինչ անհրաժեշտ է ուտեստների գեղեցիկ մատուցման համար։",
                    price: 100,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1726042244507--0.7876617191172142image.webp&w=1920&q=75"
                },
                {
                    name: "Սեղան և աթոռներ",
                    description: "Մեր օրավարձով կահույքի ծառայությունը հնարավորություն է տալիս վարձակալել բարձր որակի սեղաններ և աթոռներ՝ համաձայն ձեր կարիքների: ",
                    price: 5000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1726042865918--0.08492032329777777image.webp&w=1920&q=75"
                },
                {
                    name: "Տենտ",
                    description: "Մեր տենտերը համադրվում են ցանկացած միջոցառմանը և հիանալի լուծում են պաշտպանվելու համար ցանկացած եղանակից։ Այն կդարձնի ձեր միջոցառման անցկացման վայրը ավելի գեղեցիկ և ոճային։ Արժեքները կարող են փոփոխվել կախված չափսերից և քանակից։",
                    price: 20000,
                    imgUrl: "https://amaranoc.am/_next/image?url=https%3A%2F%2Fapi.amaranoc.am%2F1726045237838--0.5117936535743877image.webp&w=1920&q=75"
                }
            ]
        }
    ];

    return (
        <div className="px-[80px]  bg-white flex flex-col py-[20px]">

            <div className="w-full overflow-hidden mb-[10px]">
                <div className="flex w-full justify-between items-center">
                    {bajinner.map((item, index) => {
                        const isActive = active === index;
                        return (
                            <button
                                key={index}
                                onClick={() => setActive(index)}
                                className={`shrink-0 flex flex-col items-center bg-[#fff] relative pt-[24px] pb-[16px] cursor-pointer min-w-[120px] select-none group transition-all duration-200 gap-[12px]
                                    ${isActive ? 'border-t-transparent border-l-transparent border-r-transparent border-b-[3px] border-b-[#F28C28]' : 'border-b-[3px] border-transparent'}`}
                            >
                                <img
                                    src={item.image}
                                    alt={item.title}
                                    className="w-[45px] h-[45px] object-contain"
                                />
                                <span className={`text-[16px] font-medium transition-colors duration-200 ${isActive ? 'text-black' : 'text-[#333] group-hover:text-black'}`}>
                                    {item.title}
                                </span>
                            </button>
                        );
                    })}
                </div>
            </div>


            <ServicesList services={bajinner[active]?.services} />
        </div>
    );
}